Revit 2015 API
TextElement.Text Property
Get and set the content of the TextElement object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public string Text { get; set; }
Visual Basic
Public Property Text As String
	Get
	Set
Visual C++
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
Remarks
The content of TextElement object can also be accessed through the Built-In parameter TEXT_TEXT.
See Also
TextElement Class
Autodesk.Revit.DB Namespace